#### Titanic data set

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv('titanic.csv')

In [3]:
df

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
...,...,...,...,...,...,...,...,...
882,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.0000
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.0000
884,0,3,Miss. Catherine Helen Johnston,female,7.0,1,2,23.4500
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.0000
886,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.7500

In [49]:
df['Survived'].value_counts()

0    545
1    342
Name: Survived, dtype: int64

### As per actual data 38% of them are only survived

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    int64
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    object
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.6+ KB

In [17]:
df.isna().sum()

Survived                   0
Pclass                     0
Sex                        0
Age                        0
Siblings/Spouses Aboard    0
Parents/Children Aboard    0
Fare                       0
dtype: int64

In [5]:
df.drop(['Name'],axis=1,inplace=True)

In [6]:
df

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,male,22.0,1,0,7.2500
1,1,1,female,38.0,1,0,71.2833
2,1,3,female,26.0,0,0,7.9250
3,1,1,female,35.0,1,0,53.1000
4,0,3,male,35.0,0,0,8.0500
...,...,...,...,...,...,...,...
882,0,2,male,27.0,0,0,13.0000
883,1,1,female,19.0,0,0,30.0000
884,0,3,female,7.0,1,2,23.4500
885,1,1,male,26.0,0,0,30.0000
886,0,3,male,32.0,0,0,7.7500

In [7]:
df.Sex=df.Sex.replace({"male":1,"female":0})

In [8]:
df

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,1,22.0,1,0,7.2500
1,1,1,0,38.0,1,0,71.2833
2,1,3,0,26.0,0,0,7.9250
3,1,1,0,35.0,1,0,53.1000
4,0,3,1,35.0,0,0,8.0500
...,...,...,...,...,...,...,...
882,0,2,1,27.0,0,0,13.0000
883,1,1,0,19.0,0,0,30.0000
884,0,3,0,7.0,1,2,23.4500
885,1,1,1,26.0,0,0,30.0000
886,0,3,1,32.0,0,0,7.7500

#### Spliting the data by age

In [12]:
def age(agevalue):
    if agevalue<20:
        return 1
    elif agevalue<40:
        return 2
    else:
        return 3

In [14]:
df['Age']=df['Age'].apply(age)

In [15]:
df['Age']

0      2
1      2
2      2
3      2
4      2
      ..
882    2
883    1
884    1
885    2
886    2
Name: Age, Length: 887, dtype: int64

In [16]:
df

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,1,2,1,0,7.2500
1,1,1,0,2,1,0,71.2833
2,1,3,0,2,0,0,7.9250
3,1,1,0,2,1,0,53.1000
4,0,3,1,2,0,0,8.0500
...,...,...,...,...,...,...,...
882,0,2,1,2,0,0,13.0000
883,1,1,0,1,0,0,30.0000
884,0,3,0,1,1,2,23.4500
885,1,1,1,2,0,0,30.0000
886,0,3,1,2,0,0,7.7500

In [18]:
def fare(farevalue):
    if farevalue<20:
        return 1
    elif farevalue<100:
        return 2
    elif farevalue<300:
        return 3
    else:
        return 4

In [19]:
df['Fare']=df['Fare'].apply(fare)

In [20]:
df['Fare']

0      1
1      2
2      1
3      2
4      1
      ..
882    1
883    2
884    2
885    2
886    1
Name: Fare, Length: 887, dtype: int64

In [21]:
df

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,1,2,1,0,1
1,1,1,0,2,1,0,2
2,1,3,0,2,0,0,1
3,1,1,0,2,1,0,2
4,0,3,1,2,0,0,1
...,...,...,...,...,...,...,...
882,0,2,1,2,0,0,1
883,1,1,0,1,0,0,2
884,0,3,0,1,1,2,2
885,1,1,1,2,0,0,2
886,0,3,1,2,0,0,1

In [22]:
X=df[['Pclass','Sex','Siblings/Spouses Aboard','Parents/Children Aboard','Fare']].values
y=df['Survived']

In [24]:
from sklearn.linear_model import LogisticRegression

In [26]:
from sklearn.model_selection import train_test_split

In [29]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2)

In [32]:
print(X_train.shape)
print(X_test.shape)
print(y_train.shape)
print(y_test.shape)

(709, 5)
(178, 5)
(709,)
(178,)

In [30]:
model=LogisticRegression()

In [33]:
model.fit(X_train,y_train)

LogisticRegression()

In [35]:
model.predict(X_test)

array([0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1,
       1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0,
       1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1,
       0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1,
       1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1,
       0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0], dtype=int64)

In [36]:
model.score(X_test,y_test)

0.7471910112359551

In [37]:
model.score(X_train,y_train)

0.8124118476727785

In [38]:
y_predict=model.predict(X_test)

In [39]:
y_predict

array([0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1,
       1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0,
       1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1,
       0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1,
       1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1,
       0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0], dtype=int64)

In [50]:
df=pd.DataFrame({'Actual':y_test,"Predicted":y_predict})

In [51]:
df

     Actual  Predicted
679       0          0
65        1          1
431       0          0
654       0          1
205       0          0
..      ...        ...
835       1          0
24        0          0
659       0          0
442       1          0
724       0          0

[178 rows x 2 columns]

In [40]:
from sklearn.metrics import confusion_matrix

In [41]:
performance=confusion_matrix(y_test,y_predict)

In [42]:
performance

array([[94, 14],
       [31, 39]], dtype=int64)

In [44]:
print(model.score(X,y))

0.7993235625704622